app/controllers/admin/permissions_controller.rb

  def index
    @ability = Ability.new(@user)
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

  def update
    @user.permissions.clear
    permissions = params[:permissions] || []
    permissions.each do |id, permissions|
      project = Project.find(id)
      permissions.each do |permission, checked|
        Permission.create!(:user => @user, :thing => project, :action => permission)
---
SELECT `permissions`.* FROM `permissions` WHERE `permissions`.`user_id` = 2
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "3"]]
INSERT INTO `permissions` (`action`, `created_at`, `thing_id`, `thing_type`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?)  [["action", "view"], ["created_at", Mon, 10 Oct 2011 10:34:31 UTC +00:00], ["thing_id", 3], ["thing_type", "Project"], ["updated_at", Mon, 10 Oct 2011 10:34:31 UTC +00:00], ["user_id", 2]]

  def find_user
    @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1