app/views/tickets/show.html.erb

SELECT `assets`.* FROM `assets` WHERE `assets`.`ticket_id` = 1
---

      <% if @ticket.assets.exists? %>

SELECT 1 FROM `comments` WHERE `comments`.`ticket_id` = 2 LIMIT 1
---
      <div id='comments'>
        <% if @ticket.comments.exists? %> <co id='ch10_191_1' />