app/controllers/comments_controller.rb

INSERT INTO `comments` (`created_at`, `state_id`, `text`, `ticket_id`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 10 Oct 2011 10:53:36 UTC +00:00], ["state_id", 2], ["text", "afdsaf"], ["ticket_id", 3], ["updated_at", Mon, 10 Oct 2011 10:53:36 UTC +00:00], ["user_id", 6]]
INSERT INTO `tags_tickets` (`ticket_id`, `tag_id`) VALUES (5, 2)
SELECT `states`.* FROM `states`
---
  def create
    if cannot?(:"change states", @ticket.project)
      params[:comment].delete(:state_id)
    end
    @comment = @ticket.comments.build(params[:comment].merge(:user => current_user))
    if @comment.save
      if can?(:tag, @ticket.project) || current_user.admin?
        @ticket.tag!(params[:tags])
      end
      flash[:notice] = "Comment has been created."
      redirect_to [@ticket.project, @ticket]
    else
      @states = State.all

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = ? LIMIT 1  [["id", "3"]]
---
  def find_ticket
    @ticket = Ticket.find(params[:ticket_id])