app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    @projects = Project.all

INSERT INTO `projects` (`created_at`, `name`, `updated_at`) VALUES (?, ?, ?)  [["created_at", Mon, 10 Oct 2011 10:33:13 UTC +00:00], ["name", "Ticketee"], ["updated_at", Mon, 10 Oct 2011 10:33:13 UTC +00:00]]
---
  def create
    @project = Project.new(params[:project])
    if @project.save

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @project = Project.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @project = Project.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "3"]]
UPDATE `projects` SET `name` = 'TextMate 2 beta', `updated_at` = '2011-10-04 13:55:15' WHERE `projects`.`id` = 5
---
  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(params[:project])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "7"]]
DELETE FROM `projects` WHERE `projects`.`id` = ?  [["id", 7]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy