app/controllers/tickets_controller.rb

  def create
    @ticket = @project.tickets.build(params[:ticket].merge!(:user => current_user))
    if @ticket.save
---
INSERT INTO `tags_tickets` (`ticket_id`, `tag_id`) VALUES (9, 1)
INSERT INTO `tickets` (`created_at`, `description`, `project_id`, `state_id`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @comment = @ticket.comments.build
    @states = State.all
---
SELECT `states`.* FROM `states`

  def update
    if @ticket.update_attributes(params[:ticket])
---
UPDATE `tickets` SET `title` = 'Make it really shiny!', `updated_at` = '2011-10-05 07:32:33' WHERE `tickets`.`id` = 11

  def destroy
    @ticket.destroy
---
DELETE FROM `tickets` WHERE `tickets`.`id` = ?  [["id", 8]]

  def find_project
    @project = Project.for(current_user).find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "18"]]

  def find_ticket
    @ticket = @project.tickets.find(params[:id])
---
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`project_id` = 18 AND `tickets`.`id` = ? LIMIT 1  [["id", "11"]]